SunCity/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>ВнутренняяПередачаДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассуККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствИзКассыККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыПоВедомостям</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыРаботнику</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПоИмпорту</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>КонвертацияВалюты</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеПоИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаНаВнутренниеНужды</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровДоРеализации</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровПослеРеализации</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваровСПереоценкой</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеПодарочныхСертификатов</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзБанка</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПриемТоваровОтДругойОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РеализацияТоваров</name>
  </enumValues>
  <enumValues>
    <name>СдачаДенежныхСредствВБанк</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаЗатраты</name>
  </enumValues>
  <enumValues>
    <name>СписаниеПоИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровКомитенту</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеКомиссионныхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВознаграждениеОтКомитента</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаВыручки</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Documents/ВнесениеДенежныхСредствВКассуККМ/ВнесениеДенежныхСредствВКассуККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнесениеДенежныхСредствВКассуККМ</name>
  <registerRecords>AccumulationRegister.ДенежныеСредстваКПоступлениюНаличные</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваККМ</registerRecords>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
</mdclass:Document>

SunCity/src/Documents/ВыемкаДенежныхСредствИзКассыККМ/ВыемкаДенежныхСредствИзКассыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыемкаДенежныхСредствИзКассыККМ</name>
  <basedOn>Document.ОтчетОРозничныхПродажах</basedOn>
  <registerRecords>AccumulationRegister.ДенежныеСредстваКПоступлениюНаличные</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваККМ</registerRecords>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОРозничныхПродажах</name>
    <type>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
</mdclass:Document>

SunCity/src/Catalogs/НастройкиОбменСБанками/НастройкиОбменСБанками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиОбменСБанками</name>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияПоСертификату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>DefinedType.БанкОбменСБанками</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФормата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОрганизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВнешнегоМодуля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяКриптография</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействительна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьДокументыБезПодписиSMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаБанка</name>
    <type>
      <types>EnumRef.ПрограммыБанка</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВходящихДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РесурсИсходящихДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСертификатБанка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СжиматьДанныеПакетаЭД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяОбработка</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодразделенияБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноАвтоматическоеПолучениеВыписки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинДляПолученияВыписки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЛичногоКабинета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОкноПодтвержденияПлатежей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйРазмерВложенийВПисьмо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВерсияВнешнейКомпоненты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВнешняяКомпонента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбновленоПодтвердитьВБанке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсходящиеДокументы</name>
    <attributes>
      <name>ИсходящийДокумент</name>
      <type>
        <types>EnumRef.ВидыЭДОбменСБанками</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьЭП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Формировать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МаршрутПодписания</name>
      <type>
        <types>CatalogRef.МаршрутыПодписания</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодтвердитьВБанке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьSMS</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособПодтвержденияДокумента</name>
      <type>
        <types>EnumRef.СпособыПодтвержденияДокументовОбменСБанками</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыПодписейОрганизации</name>
    <attributes>
      <name>СертификатЭП</name>
      <type>
        <types>CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыБанка</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SunCity/src/CommonModules/ДенежныеСредстваВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Получает сумму денежных средств документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ПриходныйКассовыйОрдер,
//                   ДокументСсылка.РасходныйКассовыйОрдер,
//                   ДокументСсылка.РегистрацияБезналичнойОплаты - документ для расчета денежных средств.
//
// Возвращаемое значение:
//  Число - сумма документа.
//
Функция ПолучитьСуммуДокумента(ДокументСсылка) Экспорт

	Возврат ДокументСсылка.СуммаДокумента;

КонецФункции

// Получает сумму денежных средств документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ПриходныйКассовыйОрдер - документ для расчета денежных средств.
//
// Возвращаемое значение:
//  Число - сумма вознаграждения документа.
//
Функция ПолучитьСуммаВознаграждения(ДокументСсылка) Экспорт

	Возврат ДокументСсылка.СуммаВознаграждения;

КонецФункции

// Создает и возвращает документ Внесение денежных средств в кассу ККМ.
// Параметры:
//  СуммаВнесения - Число - Сумма внесения в кассу ККМ.
//  РКО - ДокументСсылка.РасходныйКассовыйОрдер - РКО на основании которого будет создан документ Внесение ДС в кассу ККМ.
//  КассаККМ - СправочникСсылка.КассыККМ - Касса ККМ в которую вносятся ДС.
//
// Возвращаемое значение:
//  ДокументСсылка.ВнесениеДенежныхСредств - возданный документ внесения денежных средств.
//
Функция СоздатьДокументВнесениеДенежныхСредствВКассуККМ(СуммаВнесения, РКО, КассаККМ) Экспорт
	Реквизиты = Справочники.КассыККМ.РеквизитыКассыККМ(КассаККМ);
	
	СтруктураДанныеЗаполнения = Новый Структура();
	СтруктураДанныеЗаполнения.Вставить("ДокументОснование", РКО);
	СтруктураДанныеЗаполнения.Вставить("Организация", Реквизиты.Организация);
	СтруктураДанныеЗаполнения.Вставить("КассаККМ", КассаККМ);
	СтруктураДанныеЗаполнения.Вставить("СуммаДокумента", СуммаВнесения);
	СтруктураДанныеЗаполнения.Вставить("Дата", ТекущаяДатаСеанса());
	СтруктураДанныеЗаполнения.Вставить("Ответственный", Пользователи.ТекущийПользователь());
	
	ДокументВнесениеДенегВКассуККМ = Документы.ВнесениеДенежныхСредствВКассуККМ.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ДокументВнесениеДенегВКассуККМ, СтруктураДанныеЗаполнения);
	ДокументВнесениеДенегВКассуККМ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	Возврат ДокументВнесениеДенегВКассуККМ.Ссылка;
	
КонецФункции

// Создает и возвращает документ Выемка денежных средств из кассы ККМ.
//
// Параметры:
//  ИзымаемаяСумма - Число - Изымаемая сумма из кассы ККМ.
//  КассаККМ - СправочникСсылка.КассыККМ - Касса ККМ в которую выполняют внесение ДС.
//  СсылкаНаОтчет - ДокументСсылка.ОтчетОРозничныхПродажах - отчет по которому создается выемка.
//  ДополнительныеПараметры - Структура дополнительных параметров.
//
// Возвращаемое значение:
//  ДокументСсылка.ВыемкаДенежныхСредствИзКассыККМ - созданный документ выемка денежных средств.
//
Функция СоздатьДокументВыемкаДенежныхСредствИзКассыККМ(Отказ,
			ИзымаемаяСумма,
			КассаККМ,
			СсылкаНаОтчет,
			ДополнительныеПараметры = Неопределено) Экспорт
						
	Если НЕ ДополнительныеПараметры = Неопределено И ДополнительныеПараметры.Свойство("ВыемкаСсылка") Тогда
		ДокументВыемка = ДополнительныеПараметры.ВыемкаСсылка.ПолучитьОбъект();
	Иначе
		ДокументВыемка = Документы.ВыемкаДенежныхСредствИзКассыККМ.СоздатьДокумент();
	КонецЕсли;
	
	Реквизиты = Справочники.КассыККМ.РеквизитыКассыККМ(КассаККМ);
	
	Если ЗначениеЗаполнено(СсылкаНаОтчет) Тогда
		ДокументВыемка.Дата = СсылкаНаОтчет.Дата + 1;
	Иначе
		ДокументВыемка.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДокументВыемка.Организация    = Реквизиты.Организация;
	ДокументВыемка.КассаККМ       = КассаККМ;
	ДокументВыемка.Магазин        = КассаККМ.Магазин;
	ДокументВыемка.СуммаДокумента = ИзымаемаяСумма;
	ДокументВыемка.Ответственный  = Пользователи.ТекущийПользователь();
	ДокументВыемка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствИзКассыККМ;
	
	ДокументВыемка.ОтчетОРозничныхПродажах = СсылкаНаОтчет;
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		Если ДополнительныеПараметры.Свойство("ДоговорКонтрагента") Тогда
			ДокументВыемка.ДоговорКонтрагента = ДополнительныеПараметры.ДоговорКонтрагента;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
	
		ДокументВыемка.Записать(РежимЗаписиДокумента.Проведение);
	
	Исключение
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Создание документа Выемка ДС из кассы ККМ'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Отказ = Истина;
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат ДокументВыемка.Ссылка;
	
КонецФункции

// Получает данные выписки банка в текстовом формате
//
// Параметры:
//  СообщениеОбмена - ДокументСсылка.СообщенияОбменСБанками - сообщение обмена с выпиской банка
//  СсылкаНаХранилище - Строка - адрес временного хранилища, куда будет помещена текстовая выписка банка
//  МассивСчетов - Массив - массив банковских счетов, находящихся в выписке
//  Организация - ОпределяемыйТип.Организация - организация, для которой получена выписка
//  НастройкаОбмена - СправочникСсылка.НастройкиОбменСБанками - действующая настройка обмена с банком.
//
Процедура ПолучитьДанныеВыпискиБанкаТекстовыйФормат(Знач СообщениеОбмена, СсылкаНаХранилище, МассивСчетов = Неопределено, Организация = Неопределено, НастройкаОбмена = Неопределено) Экспорт
	
	Перем ТекстВыписки;
	
	РеквизитыСообщения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СообщениеОбмена, "Организация, НастройкаОбмена, ВидЭД");
	
	Если НЕ РеквизитыСообщения.ВидЭД = Перечисления.ВидыЭДОбменСБанками.ВыпискаБанка Тогда
		Возврат
	КонецЕсли;
	
	Организация = РеквизитыСообщения.Организация;
	НастройкаОбмена = РеквизитыСообщения.НастройкаОбмена;
	
	ОбменСБанками.ПолучитьДанныеВыпискиБанкаТекстовыйФормат(СообщениеОбмена, СсылкаНаХранилище, МассивСчетов);
	
КонецПроцедуры

#КонецОбласти

#Область КлиентБанк

Функция ПолучитьСтруктуруПрямогоОбмена() Экспорт
	
	СтруктураОбмена = Новый Структура("БанковскийСчет, Организация, СоглашениеПрямогоОбменаСБанками");
	
	ИспользоватьОбменСБанками = ПолучитьФункциональнуюОпцию("ИспользоватьОбменСБанками");
	Если НЕ ИспользоватьОбменСБанками Тогда
		// Нет ни одной настройки обмена с банками, можно сразу выбирать файл загрузки.
		СтруктураОбмена.Вставить("БанковскийСчет", Справочники.БанковскиеСчета.ПустаяСсылка());
	Иначе
		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиОбменСБанками.Ссылка КАК НастройкиОбменСБанками,
		|	НастройкиОбменСБанками.Банк КАК Банк,
		|	БанковскиеСчета.Ссылка КАК Ссылка,
		|	НастройкиОбменСБанками.Организация КАК Организация
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиОбменСБанками КАК НастройкиОбменСБанками
		|		ПО БанковскиеСчета.Банк = НастройкиОбменСБанками.Банк
		|			И БанковскиеСчета.Владелец = НастройкиОбменСБанками.Организация
		|ГДЕ
		|	НастройкиОбменСБанками.Недействительна = ЛОЖЬ
		|	И НЕ НастройкиОбменСБанками.ПометкаУдаления
		|	И НЕ БанковскиеСчета.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БанковскиеСчета.Ссылка) КАК КоличествоРазличных
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	НЕ БанковскиеСчета.ПометкаУдаления
		|	И БанковскиеСчета.Владелец ССЫЛКА Справочник.Организации";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		РезультатЗапроса = МассивРезультатов[0];
		Если РезультатЗапроса.Пустой() Тогда // Нет ни одной настройки обмена с банками, можно сразу выбирать файл загрузки.
			СтруктураОбмена.Вставить("БанковскийСчет", Справочники.БанковскиеСчета.ПустаяСсылка());
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			ВыборкаБанковскихСчетов = МассивРезультатов[1].Выбрать();
			ВыборкаБанковскихСчетов.Следующий();
			Если ВыборкаБанковскихСчетов.КоличествоРазличных = 1 Тогда // Один счет, можно сразу подставить его.
				Выборка.Следующий();
				СтруктураОбмена.Вставить("БанковскийСчет", Выборка.Ссылка);
				СтруктураОбмена.Вставить("Организация", Выборка.Организация);
				СтруктураОбмена.Вставить("СоглашениеПрямогоОбменаСБанками", Выборка.НастройкиОбменСБанками);
			Иначе // Есть несколько счетов, нужно выбирать.
				СтруктураОбмена.Вставить("БанковскийСчет", Неопределено);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураОбмена;
	
КонецФункции

Функция ПолучитьСтруктуруОбмена(ПараметрБанковскийСчет) Экспорт
	
	СтруктураОбмена = Новый Структура("ПрямойОбмен, БанковскийСчет, Организация, СоглашениеПрямогоОбменаСБанками", Ложь);
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиОбменСБанками.Ссылка КАК НастройкиОбменСБанками,
	|	НастройкиОбменСБанками.Банк,
	|	БанковскиеСчета.Ссылка,
	|	НастройкиОбменСБанками.Организация
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиОбменСБанками КАК НастройкиОбменСБанками
	|		ПО БанковскиеСчета.Банк = НастройкиОбменСБанками.Банк
	|			И БанковскиеСчета.Владелец = НастройкиОбменСБанками.Организация
	|ГДЕ
	|	БанковскиеСчета.Ссылка = &ПараметрБанковскийСчет
	|	И НастройкиОбменСБанками.Недействительна = ЛОЖЬ
	|	И НЕ НастройкиОбменСБанками.ПометкаУдаления
	|	И НЕ БанковскиеСчета.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ПараметрБанковскийСчет", ПараметрБанковскийСчет);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда // Нет ни одной настройки обмена с банками, можно сразу выбирать файл загрузки.
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		СтруктураОбмена.Вставить("БанковскийСчет", Выборка.Ссылка);
		СтруктураОбмена.Вставить("Организация", Выборка.Организация);
		СтруктураОбмена.Вставить("СоглашениеПрямогоОбменаСБанками", Выборка.НастройкиОбменСБанками);
		СтруктураОбмена.Вставить("ПрямойОбмен", Истина);
	КонецЕсли;
	
	Возврат СтруктураОбмена;
	
КонецФункции

Функция ПрочитатьЭлектроннуюВыпискуБанка(ЭлектроннаяВыписка, СтекОповещений) Экспорт
	
	АдресФайла = Неопределено; // адрес временного хранилища
	
	ОбменСБанками.ПолучитьДанныеВыпискиБанкаТекстовыйФормат(ЭлектроннаяВыписка, АдресФайла);
		
	Если АдресФайла = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяВременногоФайла  = ПолучитьИмяВременногоФайла("txt");
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла);
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	
	ТипФайла = КлиентБанкТипФайла(ИмяВременногоФайла);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	Попытка
		ТекстовыйДокумент.Прочитать(ИмяВременногоФайла, ТипФайла);
	Исключение
		ТекстСообщения = НСтр("ru = 'Файл не прочитан.'");
		СтекОповещений.Добавить(Новый Структура("Текст", ТекстСообщения));
		Возврат Неопределено;
	КонецПопытки;
	
	Если ТекстовыйДокумент.КоличествоСтрок() < 1 Тогда
		ТекстСообщения = НСтр("ru = 'В файле нет данных!'");
		СтекОповещений.Добавить(Новый Структура("Текст", ТекстСообщения));
		Возврат Неопределено;
	КонецЕсли;
	
	Если СокрЛП(ТекстовыйДокумент.ПолучитьСтроку(1)) <> "1CClientBankExchange" Тогда
		ТекстСообщения = НСтр("ru = 'Указанный файл не является файлом обмена или неверно указана кодировка!'");
		СтекОповещений.Добавить(Новый Структура("Текст", ТекстСообщения));
		Возврат Неопределено;
	КонецЕсли;
	
	// Удаляем временный файл
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при удалении временного файла.'"), УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат ТекстовыйДокумент.ПолучитьТекст();
	
КонецФункции

Функция КлиентБанкТипФайла(ИмяФайла)
	
	Текст              = Новый ЧтениеТекста(ИмяФайла, "windows-1251");
	СтрокаТекста       = Текст.ПрочитатьСтроку();
	НомерТекущейСтроки = 0;
	
	Пока СтрокаТекста <> Неопределено Цикл
		// Проверяем кодировку файла
		Если НомерТекущейСтроки = 0 И НЕ ТолькоСимволыВСтроке(СтрокаТекста) Тогда // UTF-8.
			Возврат "UTF-8";
			Прервать;
		ИначеЕсли НЕ ТолькоСимволыВСтроке(СтрокаТекста) Тогда
			Возврат "cp866";
			Прервать;
		КонецЕсли;
		// Читаем первые пять строк, этого должно быть достаточно,
		// чтобы определить кодировку
		Если НомерТекущейСтроки > 5 Тогда 
			Прервать;
		КонецЕсли;
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		СтрокаТекста       = Текст.ПрочитатьСтроку();
	КонецЦикла;
	
	Возврат "windows-1251";
	
КонецФункции

#Область ПолучениеТекстаФайла

Функция ТолькоСимволыВСтроке(Знач ПроверяемаяСтрока)
	
	Если ПустаяСтрока(ПроверяемаяСтрока) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// приводим строку к нижнему регистру
	ПроверяемаяСтрока = НРег(СокрЛП(ПроверяемаяСтрока));
	
	// допустимые символы
	СпецСимволы = ".,;:$№#@&_-+*=?'/|\""%()[]{} ";
	
	// проверяем наличие спецсимволов в начале или конце строке
	Если ЕстьСимволыВНачалеСтроки(Лев(ПроверяемаяСтрока, 1), СпецСимволы) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// проверяем допустимые символы
	Если НЕ СтрокаСодержитТолькоДопустимыеСимволы(ПроверяемаяСтрока, СпецСимволы) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЕстьСимволыВНачалеСтроки(Строка, ПроверяемыеСимволы)
	
	Для Позиция = 1 По СтрДлина(ПроверяемыеСимволы) Цикл
		Символ = Сред(ПроверяемыеСимволы, Позиция, 1);
		СимволНайден = СтрНачинаетсяС(Строка, Символ) ИЛИ СтрЗаканчиваетсяНа(Строка, Символ);
		Если СимволНайден Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция СтрокаСодержитТолькоДопустимыеСимволы(СтрокаПроверки, ДопустимыеСимволы)
	
	// Кириллица
	КодСимволаА = КодСимвола("а"); 
	КодСимволаЯ = КодСимвола("я");
	
	// Цифры
	КодСимвола0 = КодСимвола("0");
	КодСимвола9 = КодСимвола("9");
	
	// Латиница
	КодСимволаA = КодСимвола("a");
	КодСимволаZ = КодСимвола("z");
	
	// Спецсимволы
	КодыДопустимыхСимволов = Новый Массив;
	Для Индекс = 1 По СтрДлина(ДопустимыеСимволы) Цикл
		Символ = Сред(ДопустимыеСимволы, Индекс, 1);
		КодыДопустимыхСимволов.Добавить(КодСимвола(Символ));
	КонецЦикла;
	
	КодыДопустимыхСимволов.Добавить(1105); // "ё"
	
	// Проверяем каждым символ в строке
	// допустим ли он.
	Для Индекс = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодПроверяемогоСимвола = КодСимвола(Сред(СтрокаПроверки, Индекс, 1));
		ЭтоДопустимыйСимвол = 
			КодСимволаА <= КодПроверяемогоСимвола И КодПроверяемогоСимвола <= КодСимволаЯ     // Кириллица
			ИЛИ КодСимволаA <= КодПроверяемогоСимвола И КодПроверяемогоСимвола <= КодСимволаZ // Латиница
			ИЛИ КодСимвола0 <= КодПроверяемогоСимвола И КодПроверяемогоСимвола <= КодСимвола9 // Цифры
			ИЛИ КодыДопустимыхСимволов.Найти(КодПроверяемогоСимвола) <> Неопределено;         // Спецсимволы и ё
			
		Если НЕ ЭтоДопустимыйСимвол Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПрисутствуютРасчетыЗаНоменклатурныеПозиции(ПлатежныеДокументы) Экспорт
	
	Возврат ДенежныеСредстваСервер.ПрисутствуютРасчетыЗаНоменклатурныеПозиции(ПлатежныеДокументы);
	
КонецФункции

Функция ПрисутствуютРасчетыЗаВозвратБезМарки(ДокументыВозврата, Период) Экспорт
	
	Возврат ДенежныеСредстваСервер.ПрисутствуютРасчетыЗаВозвратБезМарки(ДокументыВозврата, Период);
	
КонецФункции

#КонецОбласти
